# Basics of Python
# 1. Operator  - Symbolic represntataions of mathematical tasks

Arithmetic Operator      Conditional Operator     Logical Operator

In [15]:
# (+,-,*,/) Arithmetic Operator      
5+3   # 5-3  5*3   5/3

8

In [16]:
# with string
# "VNIT"+2  # Error
"VNIT"+"Nagpur"  # Ok

"VNIT"+"20"   # OK

"VNIT"*3  # print 3 times

'VNITVNITVNIT'

In [17]:
# (<,<=,==,>,>=,!=) Conditional Operator

In [18]:
5>3  # 5<3   5==3   5!=3

True

In [19]:
# ( and     or    not) Logical Operator
5 or 3    # 5 and 3      not - flips the boolean value  not 0-> True 
#not 0

5

# 2. Variables

Variables are names bounded to object

In [22]:
# Syntax   Variable name = Value
a=5
print(a)

5

In [29]:
# Assigment 
i=5
j=i
i=3
print(i)

3

In [30]:
print(j)

5

In [28]:
# Rules for creating varaible
#1. python is case sensitive   A=5 and a=5 both are different
# 2. Vaiable name cannot start with special character except (_)
#@same=5  # Error
_same=5   # No error

#3. Varaible name cannot start with numbers
# 9same=5 # Error

# 3. Data types in Python
int (4,-5), float(4.5,-6.7),   bool ( True, False)    String ("VNIT")

In [36]:
a=5
b=5.5
c="VNIT"

In [37]:
type(a)

int

In [38]:
type(b)

float

In [39]:
type(c)

str

# 4. Conditional Statement
# if-else    
# if -elif- else

In [41]:
# Q1. Take vaiable x and print X is EVEN if divisble by 2 otherwise ODD

x=4
if(x%2==0):
    print("EVEN")
else:
    print("ODD")

EVEN

In [45]:
# Q2. Take a varaible y and print " Grade A" if y is greater than 90, "Grade B"
# if y greater than 60 but less than 90 and otherwise grade " F"


y=92
if(y>90):
    print("Grade A")
elif(y>=60 and y<=90):
    print("Grade B")
else:
    print("Grade F")

Grade A

# 5. Loops  -> any opertaion do numbers of times
# for      
# while

In [46]:
for i in range(5):
    print("VNIT")

VNIT
VNIT
VNIT
VNIT
VNIT

In [47]:
for i in range(5):  # strat from 0 to less than 5
    print(i)

0
1
2
3
4

In [49]:
# Q1. Write a for loop to print all the numbers between 10 and 20
for i in range(10,20):   # range ( start, end)
    print(i)

10
11
12
13
14
15
16
17
18
19

In [50]:
# Q2. Write a for loop to print al the odd numbers between 10 and 20
for i in range(11,20,2):  #  range ( start, end, updation)
    print(i)

11
13
15
17
19

In [51]:
# Q3. Write a while loop to print all the numbers between 10 and 20
i=11
while(i<20):
    print(i)
    i=i+1

11
12
13
14
15
16
17
18
19

In [52]:
# Q4. Write a while loop to print al the odd numbers between 10 and 20
i=11
while(i<20):
    print(i)
    i=i+2

11
13
15
17
19

# 6. Function   #  Reusable , specif problem, Built in , user define
# def fun_name(arg):
#        return

#Built in  print(), range(), max, min()
#Userdfine Area_of_Circle()

In [54]:
#Q1. Take radius and print area of circle 
def area_of_circle(radius):
    return 3.14*radius*radius

In [57]:
a=area_of_circle(5) # change 5 - 6,7,8,
print(a)

78.5

In [58]:
#Q2. Create a function that takes two numbres as arguments and returns the greater of the two .
def greteroftwo(a,b):
    if(a>b):
        gr=a
    else:
        gr=b
    return gr

In [60]:
gre=greteroftwo(30,20)
print(gre)

30

# Data Structure

# Existing data types - int, float , str -> Single formate

# person( Name, age, Salary)
# More number of varaible required
# Unfit for stroing large data

# 1. List- [1,2,'VNIT',55.5,'Nagpur']

# 2. Dict - {'VNIT': 1960, 'VJTI':1887, 'COEP':1854}

In [ ]:
# 1. Store marks of all studnet in class 2. Whta is avg marks of last 5 std   
# roll1=52, roll2=86,......

# Topics in LIST
1. What is list 2. Sub-setting list 3. Add element 4. selete ele  5. Loop on list

In [62]:
# A list is an ordered data structure with elemets seprated by comma and enclosed with square brackets.
# e.g
list1=[1,2,3,4]  # same data
list2=['VNIT','Nagpur','1960']  # same data

In [63]:
print(list1)

[1, 2, 3, 4]

In [64]:
print(list2)

['VNIT', 'Nagpur', '1960']

In [99]:
list3=['VNIT','Nagpur',1960]  # mix data types

In [100]:
print(list3)

['VNIT', 'Nagpur', 1960]

In [70]:
type(list3)

list

2. Sub-setting list

In [72]:
list4=[1,'VNIT',2,'Nagpur',3,'India']

In [75]:
print(list4[2],list4[3])

2 Nagpur

In [76]:
list4[1:3]  # take from 1 to less than 3 index i.e 1 to 2

['VNIT', 2]

In [77]:
list4[1:4] # take from 1 to less than 4 index i.e 1 to 3

['VNIT', 2, 'Nagpur']

In [78]:
# Negative - index
list4[-1]  # last index

'India'

3.Add element

In [82]:
list4=[1,'VNIT',2,'Nagpur',3,'India']
list4

[1, 'VNIT', 2, 'Nagpur', 3, 'India']

In [83]:
list4.append(23) # add single elemt in last using append
list4

[1, 'VNIT', 2, 'Nagpur', 3, 'India', 23]

In [85]:
list4.extend([25,26,27])  # add multiple element using extend
list4

[1, 'VNIT', 2, 'Nagpur', 3, 'India', 23, 25, 26, 27, 25, 26, 27]

In [98]:
list3

['VNIT', 'Nagpur', [2000, 2020]]

In [101]:
# add list in list 

list3.append([2000,2020])
list3

['VNIT', 'Nagpur', 1960, [2000, 2020]]

4. delete element

In [102]:
list3

['VNIT', 'Nagpur', 1960, [2000, 2020]]

In [103]:
list3.remove(1960)  # delete an elemnt by value
list3

['VNIT', 'Nagpur', [2000, 2020]]

In [104]:
del list3[2] # delete an element by index
list3

['VNIT', 'Nagpur']

5. Loop in list

In [105]:
list4

[1, 'VNIT', 2, 'Nagpur', 3, 'India', 23, 25, 26, 27, 25, 26, 27]

In [106]:
for i in list4:  # print an element of list using i
    print(i)

1
VNIT
2
Nagpur
3
India
23
25
26
27
25
26
27

In [115]:
marks5=[55,56,58,96,85,23,47,88,23]

In [116]:
marks5

[55, 56, 58, 96, 85, 23, 47, 88, 23]

In [117]:
marks5.append(100)
marks5

[55, 56, 58, 96, 85, 23, 47, 88, 23, 100]

In [118]:
marks5.extend([101,102,103])
marks5

[55, 56, 58, 96, 85, 23, 47, 88, 23, 100, 101, 102, 103]

In [119]:
marks5.remove(100)
marks5

[55, 56, 58, 96, 85, 23, 47, 88, 23, 101, 102, 103]

In [120]:
del marks5[2:5]
marks5

[55, 56, 23, 47, 88, 23, 101, 102, 103]

In [121]:
for i in marks5:
    print(i)

55
56
23
47
88
23
101
102
103

# Dictionary

In [122]:
Rajesh={'maths':55,'phy':82,'bio':89,'chem':56} # marks of each subjects

In [127]:
Rajesh['maths']

55

1. What is a Dictinary

 A Dictinary is an un-ordered data stucture with elements seprated by comma and stored as key: value pair. 
#A dictionary is enclosed with curly brackets

In [129]:
dict1={'VNIT':1960, 'VJTI':1887,'COEP':1854}  # Dict = Key: values

In [141]:
dict2={'VNIT':[1960,'Nagpur'], 'VJTI':[1887,'Mumbai'],'COEP':[1854,'Pune']}  # Dict = Key: Value in form of list

In [142]:
dict2

{'VNIT': [1960, 'Nagpur'], 'VJTI': [1887, 'Mumbai'], 'COEP': [1854, 'Pune']}

2. Accesing elments of a Dictinary

In [132]:
dict1[2]  # Error , becuse value store using key

KeyError: 2

In [133]:
dict1['VNIT']

1960

3. Adding element in Dictinary

In [135]:
dict1

{'VNIT': 1960, 'VJTI': 1887, 'COEP': 1854}

In [136]:
dict1['IITB']=1958

In [137]:
dict1

{'VNIT': 1960, 'VJTI': 1887, 'COEP': 1854, 'IITB': 1958}

In [143]:
dict2

{'VNIT': [1960, 'Nagpur'], 'VJTI': [1887, 'Mumbai'], 'COEP': [1854, 'Pune']}

In [144]:
dict2['IITB']=[1958,'Bombay']

In [145]:
dict2

{'VNIT': [1960, 'Nagpur'],
 'VJTI': [1887, 'Mumbai'],
 'COEP': [1854, 'Pune'],
 'IITB': [1958, 'Bombay']}

Add multiple value in dict using Update functiom

In [147]:
dict1

{'VNIT': 1960, 'VJTI': 1887, 'COEP': 1854, 'IITB': 1958}

In [148]:
dict1.update({'SGGS':1981,'Walchand':1947})  # add multiple values

In [149]:
dict1

{'VNIT': 1960,
 'VJTI': 1887,
 'COEP': 1854,
 'IITB': 1958,
 'SGGS': 1981,
 'Walchand': 1947}

4. Delete element of a Dictinary

In [150]:
del dict1['VJTI']

In [151]:
dict1

{'VNIT': 1960, 'COEP': 1854, 'IITB': 1958, 'SGGS': 1981, 'Walchand': 1947}

In [152]:
dict2

{'VNIT': [1960, 'Nagpur'],
 'VJTI': [1887, 'Mumbai'],
 'COEP': [1854, 'Pune'],
 'IITB': [1958, 'Bombay']}

In [153]:
del dict2['COEP']

In [154]:
dict2

{'VNIT': [1960, 'Nagpur'], 'VJTI': [1887, 'Mumbai'], 'IITB': [1958, 'Bombay']}

# Standard Library ,     Module  ,    Package

Basic things - Standard Library
Extra things - Modules / Packages

Standard Library-   
Built function( print, min, max)
Data Types (int , float, str, bool)
Built in constants ( False, True, None)
File Formats( csv, excel, hdf5)

Module  

Arithmetic.py   # this a module with name Arithmetic
def add():
    ---
    ---
def sub():
    ---
    ---
def mul():
    ---
    ---
def div():
    ---
    ---

Package - Collections of modules

#Operator  is a package which is collection of all opertors
Arithmetic.py
Logical.py
Comparison.py

# Importing a module

In [ ]:
# from Operator.Arithmetic import add    >>>>> add(3,5)

#or

# from Operator import Arithmetic    >>>>> Arithmetic.add(3,5)

# Pandas

1.Introduction to Pandas
2.Why to use Pandas?
3.Reading a spreadsheet ( CSV and Excel)
4.What is DataFrame and its Operations?
5.Indexing / Selection in DataFrame
6.Column selection, addition and delection
7.Subsetting in DataFrame
8.Exporting DataFame to spreadsheet (CSV and Excel)

1.Introduction to Pandas

Pandas is powerful python data analysis toolkit for Reading , Filtering, Manipulating, Visualizing and Exporting data

2.Why to use Pandas?

Wide range of functionalites such as
1.Reading diffrent varieties of data  ( csv, excel, json ,etc.)
2.Functions for filtering , selecting and manipulating data
3.Plotting data for visualization and exploration purpose
4.Huge contribution and support from developer community

3.Reading a spreadsheet ( CSV and Excel)

# Pandas can help you read data from diffrent types of files
csv, json, html, excel, sql, hdf, gdb, sas, clipboard, etc.

In [159]:
#importing the Pandas libaray
import pandas as pd

In [163]:
#read the csv file
df=pd.read_csv("data.csv") 
# df > data frame varaibel,   read_csv > keyword for reading file using pandas

In [164]:
df.head() # first 5 rows of data df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [166]:
# read excel file
df1=pd.read_excel("data.xlsx")

In [167]:
df1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

# What is DataFrame and its operation

A Dataframe is similar to excel workbook tabular datasheet
Data frame start with "0"

DataFame.shape()   > rows X columns
DataFame.head(n)/ tail(n)
DataFame.columns  > All coln names
DataFame["columnname"]
DataFame[["column1","column2"]]

In [169]:
df.shape  # How many rows and column

(891, 12)

In [170]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [171]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [172]:
df['Sex'] # all the data fro this column

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [173]:
df[['Name','Sex','Age']]  # Multiple columns

                                                  Name     Sex   Age
0                              Braund, Mr. Owen Harris    male  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                               Heikkinen, Miss. Laina  female  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                             Allen, Mr. William Henry    male  35.0
..                                                 ...     ...   ...
886                              Montvila, Rev. Juozas    male  27.0
887                       Graham, Miss. Margaret Edith  female  19.0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN
889                              Behr, Mr. Karl Howell    male  26.0
890                                Dooley, Mr. Patrick    male  32.0

[891 rows x 3 columns]

In [177]:
max(df['Fare'])

512.3292

In [190]:
#select the rows which has maximum fare
df[df['Fare']==max(df['Fare'])]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
258,259,1,1,"Ward, Miss. Anna",female,35.0,0,0,PC 17755,512.3292,NaN,C
679,680,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C
737,738,1,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C

In [192]:
#select the rows which has minimum fare
df[df['Fare']==min(df['Fare'])]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
179,180,0,3,"Leonard, Mr. Lionel",male,36.0,0,0,LINE,0.0,NaN,S
263,264,0,1,"Harrison, Mr. William",male,40.0,0,0,112059,0.0,B94,S
271,272,1,3,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0,NaN,S
277,278,0,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0,NaN,S
302,303,0,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,NaN,S
413,414,0,2,"Cunningham, Mr. Alfred Fleming",male,NaN,0,0,239853,0.0,NaN,S
466,467,0,2,"Campbell, Mr. William",male,NaN,0,0,239853,0.0,NaN,S
481,482,0,2,"Frost, Mr. Anthony Wood ""Archie""",male,NaN,0,0,239854,0.0,NaN,S
597,598,0,3,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0,NaN,S
633,634,0,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0,NaN,S
674,675,0,2,"Watson, Mr. Ennis Hastings",male,NaN,0,0,239856,0.0,NaN,S
732,733,0,2,"Knight, Mr. Robert J",male,NaN,0,0,239855,0.0,NaN,S
806,807,0,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0,A36,S
815,816,0,1,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0,B102,S
822,823,0,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0,NaN,S

On cancer Data

In [179]:
df3=pd.read_csv("cancer_data.csv")

In [180]:
df3.head()

,ID,Clump_Thickness,Cell_Size_Uniformity,Cell_Shape_Uniformity,Marginal_Adhesion,Single_Epithelial_Cell_Size,Bare_Nuclei,Bland_Chromatin,Normal_Nucleoli,Mitoses,Cancer_Type
0,1000025,5,1,1,1,2.0,1,3,1,1,2
1,1002945,5,4,4,5,NaN,10,3,2,1,2
2,1015425,3,1,1,1,2.0,2,3,1,1,2
3,1016277,6,8,8,1,3.0,4,3,7,1,2
4,1017023,4,1,1,3,2.0,1,3,1,1,2

In [181]:
# Selecting 1 column
df3['Bare_Nuclei']

0       1
1      10
2       2
3       4
4       1
       ..
694     2
695     1
696     3
697     4
698     5
Name: Bare_Nuclei, Length: 699, dtype: object

In [182]:
# Selecting multiple column
df3[['Clump_Thickness','Marginal_Adhesion']]

     Clump_Thickness  Marginal_Adhesion
0                  5                  1
1                  5                  5
2                  3                  1
3                  6                  1
4                  4                  3
..               ...                ...
694                3                  1
695                2                  1
696                5                  3
697                4                  4
698                4                  5

[699 rows x 2 columns]

In [184]:
# Selecting rows by their postion
df3.iloc[:5]

,ID,Clump_Thickness,Cell_Size_Uniformity,Cell_Shape_Uniformity,Marginal_Adhesion,Single_Epithelial_Cell_Size,Bare_Nuclei,Bland_Chromatin,Normal_Nucleoli,Mitoses,Cancer_Type
0,1000025,5,1,1,1,2.0,1,3,1,1,2
1,1002945,5,4,4,5,NaN,10,3,2,1,2
2,1015425,3,1,1,1,2.0,2,3,1,1,2
3,1016277,6,8,8,1,3.0,4,3,7,1,2
4,1017023,4,1,1,3,2.0,1,3,1,1,2

In [185]:
# Selecting columns by their postion
df3.iloc[:,:2]  # first : indicate rows and second : indicate columns

          ID  Clump_Thickness
0    1000025                5
1    1002945                5
2    1015425                3
3    1016277                6
4    1017023                4
..       ...              ...
694   776715                3
695   841769                2
696   888820                5
697   897471                4
698   897471                4

[699 rows x 2 columns]

In [186]:
# Secte firt 3 rows and first 5 columns
df3.iloc[:3,:5]

,ID,Clump_Thickness,Cell_Size_Uniformity,Cell_Shape_Uniformity,Marginal_Adhesion
0,1000025,5,1,1,1
1,1002945,5,4,4,5
2,1015425,3,1,1,1

In [189]:
# select row by some condition
df3[df3['Cancer_Type']==2]

,ID,Clump_Thickness,Cell_Size_Uniformity,Cell_Shape_Uniformity,Marginal_Adhesion,Single_Epithelial_Cell_Size,Bare_Nuclei,Bland_Chromatin,Normal_Nucleoli,Mitoses,Cancer_Type
0,1000025,5,1,1,1,2.0,1,3,1,1,2
1,1002945,5,4,4,5,NaN,10,3,2,1,2
2,1015425,3,1,1,1,2.0,2,3,1,1,2
3,1016277,6,8,8,1,3.0,4,3,7,1,2
4,1017023,4,1,1,3,2.0,1,3,1,1,2
...,...,...,...,...,...,...,...,...,...,...,...
690,654546,1,1,1,3,2.0,1,1,1,1,2
692,714039,3,1,1,1,2.0,1,1,1,1,2
693,763235,3,1,1,1,2.0,1,2,1,2,2
694,776715,3,1,1,1,3.0,2,1,1,1,2
695,841769,2,1,1,1,2.0,1,1,1,1,2